{
    "header": {
        "compilationNumber": 170,
        "month": "February",
        "fortnight": "1st half"
    },
    "posts": [
        {
        "URL": "https://peakd.com/hive-173286/@imx.center/gumeta-update-deck-codes",
        "comment": "An important update that matters to every player using Gumeta (seriously, that should literally be everyone) bringing deck codes for easy import into the game client or any other place you need.",
        "preview": "Did I say no more updates on Gumeta? I probably meant less focus on Gumeta development :)<br>To be honest, with the new Battle Pass and recent improvements in Gods Unchained, the future looks bright and I found new motivation to make Gumeta even better.<br>This is a feature many of you were waiting for, especially"
        },
        {
        "URL": "https://peakd.com/hive-173286/@aubryd/pmiidngg",
        "comment": "A bit of a mixed-bag post, but includes a replay of an interesting match, and especially interesting is the usage of GIFs to illustrate important gameplay moments.",
        "preview": "Hello everyone, as I mentioned in the title of this post, this time I want to show you a battle using my Amazon deck vs a War deck. But first, I want to share with you my performance from the last Weekend Ranked. This time I was able to win"
        },
        {
        "URL": "https://peakd.com/hive-173286/@cryptoniusrex/fallen-age-full-set-reaction-a-gu-yt-video",
        "comment": "A rather short post, but the true value lies in the 1 hour and 28 minutes video where the author goes through a detailed review of the upcoming expansion Fallen Age.",
        "preview": "In this GU video I look at EVERY card in the set and give my thoughts. It's all hashed out in there pretty well but to TLDR it there are strong things coming this set that are desirable for most of the gods. The hand drawn mythics are also snazzy. You can"
        },
        {
        "URL": "https://peakd.com/hive-173286/@cryptoniusrex/using-every-light-atlantean-in-a-deck-at-the-same-time-and-some-thoughts-on-the-archtype",
        "comment": "A very creative, out-of-the-beaten-path idea for a Light deck using some infamous and also seldom-used cards. It takes a special kind of talent to come up with ideas like this.",
        "preview": "Yes, it's a overheal light deck with BOTC. But I've been told it is more fun to play against than the norm, there is an interplay of bodies and removals not just Lysander sitting all by himself tossing spells left and right. Sadly cards like heiragon and prophet of progress require"
        },
        {
        "URL": "https://peakd.com/hive-173286/@ifhy/gods-unchained-do-i-need-an-expensive-deck-to-play-well-enpt",
        "comment": "Do you need to buy expensive cards to be competitive? Maybe not, and this author will explain why, and offer some examples!",
        "preview": "If there’s one question that always comes up when we talk about Gods Unchained, it's even on Reddit GodsUnchained.<br>Do I need an expensive deck to play well?<br>Can I win against other players without making a big investment?<br>And when I say play well, I’m not just talking about logging in, playing a match, and leaving. I mean climbing the ranks, earning some rewards, and feeling like you’re actually progressing"
        },
        {
        "URL": "https://peakd.com/hive-173286/@agrante/elderytch-mysteries-explained",
        "comment": "In this post authored by me, I explain how the Elderytch Mysteries work, a group of cards for the Magic God in the Dread Awakening expansion set.",
        "preview": "The Dread Awakening expansion set introduced a new game mechanic for the Magic God - Elderytch Mysteries. These are a new set of spells that do not exist as minted cards (NFTs), but are generated exclusively from other cards. They are organized in tiers and there also a few"
        }
    ]
}
